<template>
<div class="container">
 <heads :title="title"></heads>

  <div class="contract-body">
                <div class="contract">
                    <h1>
                       服务协议
                    </h1>
                    <h2>
                       甲方：湖南金洋信息技术有限公司系http://hrjfwww.cpb168.com/网站(以下简称“恒瑞金服”)的运营商
                    </h2>
                    <h2>
                        乙方：恒瑞金服的注册用户,其恒瑞金服真实姓名为 {{username}}, 其身份证号码为 {{usercoder}} （以下简称“投资人”）。
                    </h2>
                    <p>
                        以上两方合称“各方”,单称“一方”。
                    </p>
                    <p>鉴于:</p>
                    <p>(a)投资人是一名投恒瑞金服的注册用户,已经与恒瑞金服签订了注册协议。</p>
                    <p>(b)恒瑞金服致力于为恒瑞金服的用户提供更加优质的服务，更好的用户体验。</p>
                    <p>(c)根据本协议,投资人同意委托恒瑞金服在投资人选定的条件范围内对产品进行自动选择,并自愿遵守恒瑞财富现有的相关协议及规则。</p>
                    <h2>有鉴于此,各方经友好协商,本着平等、自愿的原则,达成如下条款:</h2>
                    <h2>一、宗旨</h2>
                    <p>投资人愿意以自有合法资金投资于在恒瑞金服上公开的固定理财产品,恒瑞金服愿意接受投资人委托，向投资人提供在投资人选定的条件下投资于具体固定理财产品的服务。各方基于本协议签署的相关其他法律文件不得违背本协议所确定的原则。</p>
                    <h2>二、权利义务</h2>
                    <p>1、投资人所支付的加入资金须为合法取得,且投资人对加入资金拥有完全且无瑕疵的处分权。</p>
                    <p>2、投资人为履行本协议而向恒瑞金服提供的全部资料均真实、有效。</p>
                    <p>3、投资人开启自动投标，且选定对所投产品的要求，即可开通自动投标服务。</p>
                    <p>4、投资人须通过恒瑞金服网站平台了解“自动投标”相关信息。</p>
                    <p>5、恒瑞金服在接受投资人委托后，根据投资人对固定理财产品的要求，在恒瑞金服APP上已经发布的固定理财产品中，为投资人提供自动投标服务。恒瑞金服不对固定理财产品的收益、本息回报声明与承诺。</p>
                    <h2>投资人在此无条件且不可撤销地同意并确认:</h2>
                    <p>（1）自投资人开启“自动投标”服务起,投资人即通过恒瑞金服优先自动投标,并通过恒瑞金服以投资人的名义自动签署相关借款协议、债权转让协议;投资人对此等自动投标和自动签署相关借款协议、债权转让协议的安排已充分知悉并理解;该等自动签署的借款协议、债权转让协议均视为投资人真实意思的表示,投资人对该等法律文件的效力均予以认可且无任何异议,并无条件接受该等自动签署的借款协议、债权转让协议的约束。</p>
                    <p>（2）投资人通过恒瑞金服自动投标而签署之借款协议、债权转让协议等法律文件或其中的相关条款生效后,恒瑞金服即可根据该等协议和本协议相关约定,对相关款项进行扣划、支付、冻结以及行使其他权利,投资人对此均予以接受和认可。</p>
                    <p>投资人的上述保证在本协议整个期间和其他本协议内产生的任何协议期间应当持续合法、有效并具有法律约束力。</p>
                    <h2>在签署本协议之前,恒瑞金服已就本协议及有关交易文件的全部条款和内容进行了详细的说明和解释,投资人已认真阅读本协议有关条款,对有关条款不存在任何疑问或异议,并对协议各方的权利、义务、责任与风险，尤其是本协议项下委托事项有清楚和准确的理解。</h2>
                    <p>6、通知</p>
                    <p>各方一致同意,本协议履行过程中,各方之间的意思通知及往来文件,均可通过电子邮件、 站内信传达对方,电子邮件及站内信发出日即视为送达日。</p>
                    <p>7、协议效力</p>
                    <p>（1）协议的生效:本协议自投资人在恒瑞金服操作完成对自动投标的固定理财产品的要求、确认同意签署本协议并支付完毕拟投资资金、经恒瑞金服确认投资人成功开启“自动投标”服务时(以投资人的恒瑞金服账户信息显示为准)生效。</p>
                    <p>本协议采用电子文本形式制成,每一份具有同等法律效力,并永久保存在恒瑞金服服务器上备查,对各方均具有法律约束力。</p>
                    <p>（2）协议的变更及终止:除经各方协商一致并达成书面协议外,任何一方不得单方变更或终止本协议,本协议另有约定的除外。</p>
                    <p>(3）若本协议项下的任一或多个条款被视为无效、违法或无法执行,则本协议其他部分条款 的有效性、合法性和可执行性不受任何影响和损害。上述条款将由各方通过合法方式以尽 可能反映该条本意的条款予以代替。</p>
                    <p>8.不可抗力</p>
                    <p>本协议各方均确认,如因法律、法规及相关政策的出台和变化或监管原因从而导致本协议项下交易模式、交易规则变动或本协议约定的服务被采取监管措施或停止实施的,协议各方互不主张违约及赔偿责任,恒瑞金服将根据本协议积极调整交易模式。</p>
                    <p>9.法律适用和争议解决</p>
                    <p>本协议适用中华人民共和国法律,并根据其进行解释。如发生争议,各方可排他地将争议提交至恒瑞金服所在地有管辖权的人民法院解决。</p>
                </div>
            </div>

  </div>

</div>

</template>

<script>
import heads from '../../components/head'
export default {
  data () {
    return {
      title: '自动投标服务协议',
      username:"--",
      usercoder:"--",
      state:this.$store.state,
    }
  },

  mounted : function() {

  },
  methods:{
           userinfo(){
              let _this = this
                this.$http(this.$api.QueryRealNameInfo({}))
                 .then((data) => {
                    console.log(data.data.ResultData)
                    _this.username = data.data.ResultData.RealName
                    _this.usercoder = data.data.ResultData.IDCardNo
                })
            },
            userRealNameStatus(){
                let _this = this
                this.$http(this.$api.QueryRealNameStatus({}))
                 .then((data) => {
                    //1.未认证，2.正在审核，3.认证成功，4，认证失败
                    if(data.data.ResultData.CheckStatus==3){
                        _this.userinfo()
                    }

                })
            }
  },
  created:function(){
      if(typeof this.state.user !="undefined"){
        this.userRealNameStatus()
      }
  },
  components:{
    heads
  }
}
</script>
<style lang="scss" scoped>

div.contract { width: auto; padding: 15px; background:#fff;}
div.contract h1{text-align:center; font-size:0.45rem;}
div.contract h2 { margin: 8px 0px; }
div.contract p{font-size:0.35rem}
</style>