<template>
<div class="container">
 <heads :title="title"></heads>

  <div class="contract-body">
                <div class="contract">
                    <p>
                        尊敬的投资客户：
                    </p>
                    <p>
                       为了维护您的自身权益、防范投资风险，请在投资前仔细阅读本协议各条款以及与本产品相关的全部产品规则，以充分知悉、了解本协议项下产品的运作规则、投资范围以及协议双方的权利、义务和责任。本协议由湖南财富恒瑞投资有限公司制订，一旦签署本协议即视为对上述及协议全部条款及相关业务规则已充分理解并完全接受。
                    </p>
                    <p>
                        甲方：{{usernamer}}
                    </p>
                    <p>
                        身份证号码：{{usercode}}
                    </p>
                   <p class="top30">乙方：湖南财富恒瑞投资有限公司</p>
                   <p>注册号：431100000037055</p>
                   <p class="top30">甲方为恒瑞金服APP会员，具有完全行为能力，有权签署本协议；</p>
                   <p>乙方为湖南财富恒瑞投资有限公司，是本协议项下债权/收益权的出让人；</p>
                   <p>就乙方通过湖南金洋信息技术有限公司运营管理的平台恒瑞金服APP（以下统称“恒瑞金服APP”）居间而形成的有关债权/收益权转让给甲方事宜，双方经协商一致，达成如下协议：</p>
                   <p class="top30">重要须知</p>
                   <p>1、本产品仅向依据中华人民共和国有关法律法规及本协议规定可以购买本理财产品的合格投资者发售。</p>
                   <p>2、在购买本产品前，请甲方确保完全知晓本产品的性质、其中涉及的风险以及投资者的自身情况。</p>
                   <p>3、在本产品的存续期内，如因国家法律法规、监管规定发生变化，或是出于维持本产品正常运营的需要，在不损害甲方利益的前提下，乙方有权单方对本协议进行修订。乙方决定对本协议进行修订，将委托恒瑞金服APP告知甲方。甲方应根据本协议所载的公告方式时常查询相关信息，如因甲方未及时查询，或通讯故障、系统故障以及其他不可抗因素的影响使得甲方未能及时了解到相关调整，由此产生的责任和风险甲方自行承担。</p>
                   <p>4、乙方有权依法对本协议进行解释。</p>
                   <p class="top30">协议条款</p>
                   <p>第一条 转让标的</p>
                   <p>1.1 乙方自愿将其拥有的部分债权/收益权（以下简称标的债权/收益权）以债权/收益权转让之方式转让给甲方，甲方同意按照本合同约定条件和方式予以受让。</p>
                   <p>1.2 甲乙双方一致同意并确认，因本协议项下产品为活期产品，甲方基于本协议约定所受让之标的债权/收益权本金以甲方在“恒瑞金服APP”活期宝产品信息中所载明的金额为准；甲方在此知晓，本协议一经签署，将作为甲方在“恒瑞金服APP”购买活期宝产品的唯一协议，甲方日后在“恒瑞金服APP”继续购买活期宝产品的，均以本协议为准；甲方购买活期宝产品后部分或全部终止本协议的，甲方持有活期宝产品之金额以甲方在“恒瑞金服APP”活期产品信息中所载明的金额为准。</p>
                   <p>1.3 甲乙双方在此确认，在本协议项下债权/收益权受让第二日为起始日，即T+1日开始计算利息。</p>
                   <p>预期年化收益及计算方式：详见活期宝产品属性</p>
                   <p>1.4 甲乙双方在此确认，本协议项下产品为活期产品，即甲方可以随时部分/全部终止本协议，甲方部分/全部终止本协议的，甲方授权乙方将其享有的部分/全部标的债权/收益权以债权/收益权转让之方式转让给恒瑞金服APP的其他会员后向甲方结算收益，或甲方持有的部分/全部标的债权/收益权所对应的资产与甲方终止本协议时一同到期的，乙方将协助甲方向资产方结算收益。</p>
                   <p>第二条 标的债权/收益权的交割</p>
                   <p>2.1 甲乙双方一致同意自甲方完成标的债权/收益权转让价款的支付之日起，标的债权/收益权由乙方转移至甲方，甲方享受标的债权/收益权的权益。</p>
                   <p>2.2 标的债权/收益权交割之前已发生但尚未支付的收益归乙方享有；交割之后标的债权/收益权的收益等概由甲方享有。</p>
                   <p>2.3 甲方在此知晓并同意，为保障甲方利益，甲方在此不可撤销的授权乙方不定期的对甲方所享有的标的债权/收益权进行重组及匹配。</p>
                   <p>第三条 甲方声明和保证</p>
                   <p>3.1 甲方具有完全民事权利能力和完全民事行为能力，能够独立承担民事责任，签订和履行本协议不会违反对其有约束力的法律法规或监管规定，也不违反任何约束或影响乙方或其资产的裁决、命令、协议、或承诺。</p>
                   <p>3.2 甲方保证用于受让标的债权/收益权的资金是其自有或其有权处分的合法资金，如果第三人对该资金归属、合法性等问题提出异议，甲方保证负责协调解决并承担相关责任，与乙方或者恒瑞金服无关。</p>
                   <p>3.3 在签署本协议前，甲方已经详细了解标的债权/收益权的相关情况以及恒瑞金服APP的有关业务规则和交易说明，对受让标的债权/收益权可能存在的风险以及受让该等标的债权/收益权后的所有权利、义务有了充分、全面的认识，清楚知悉其中的投资风险，经独立、审慎判断后仍做出投资决定，自愿签署本协议并承担投资风险。</p>
                   <p>第四条 乙方声明和保证</p>
                   <p>4.1 乙方声明本协议项下标的债权/收益权系其真实、合法、有效拥有的债权/收益权。</p>
                   <p>4.2 乙方保证在签署本协议之前，未就本协议标的债权/收益权上设置任何权利障碍。</p>
                   <p>第五条 违约责任</p>
                   <p>5.1 一方违反其在本协议中所作的声明和保证或未完全履行其在本协议项下的义务，即视为违约，因此给守约方造成损失的，违约方应予赔偿。</p>
                   <p>5.2 违约方因违约应赔偿给守约方的损失，包括但不限于因违约给守约方造成的直接损失，以及守约方在协议履行后可以获得的利益、守约方为防止或减少损失的扩大而支出的合理费用、守约方支付的诉讼费和律师费等间接损失。</p>
                   <p>第六条 债权/收益权转让通知</p>
                   <p>6.1 若甲方自本协议项下所受让之标的债权/收益权需要向原债权人履行债权/收益权转让通知义务的，甲方在此不可撤销的委托乙方代为通知原债权人。</p>
                   <p>第七条 法律适用与争议处理</p>
                   <p>7.1 本协议的订立、效力、解释、履行、修改、终止以及争议的处理等，均适用中国的法律。</p>
                   <p>7.2因本合同引起的或与本合同有关的争议，各方应友好协商解决；协商不成的，各方一致同意，不论争议金额大小，均提交法院管辖。</p>
                   <p>第八条 其他事项</p>
                   <p>8.1协议生效</p>
                   <p>本协议经甲方在恒瑞金服APP上点击确认的方式签署时成立，自甲方完成标的债权/收益权转让价款支付后立即生效。</p>
                   <p>8.2协议文本</p>
                   <P>甲乙双方一致同意并确认本协议采用电子文本形式制成，由恒瑞金服APP代为保管并保存在恒瑞金服APP为此设立的专用服务器上备查，对双方均具有法律约束力。</P>
                </div>
            </div>

  </div>

</div>

</template>

<script>
import heads from '../../components/head'
export default {
  data () {
    return {
      title: '活期宝投资协议',
      usernamer:"",
      usercode:""
    }
  },

  mounted : function() {

  },
  methods:{

  },
  created:function(){
    let _this = this
    this.$http(this.$api.getuserinfoTotal({}))
      .then((data) => {
        console.log(data.data)
        _this.usernamer = data.data.ResultData.RealName
        _this.usercode = data.data.ResultData.IDCardNo
      });
  },
   components:{
    heads
  }
}
</script>
<style lang="scss" scoped>
.contract {width:100%; margin:auto;padding:rem(15); box-sizing:border-box;font-size:0.4rem; background:#fff;}
.contract h1{text-align:center;}
.contract h2 { margin: 8px 0px; }
.contract p{margin-top:rem(10);}
.contract p.top30{margin-top:rem(30);}
</style>