<template>
<div class="container">
 <heads :title="title" v-show="fromzero"></heads>

  <div class="contract-body">
                <div class="contract">

                    <p>
                        定向委托投资管理协议（以下简称“本协议”）是湖南财富恒瑞投资有限公司（以下简称“本公司”或“甲方”）接受委托人（以下简称“您”或“乙方”）的委托，就本协议项下所述定向委托投资相关事项所订立的有效协议。本协议由第一部分“定向委托投资标的”和第二部分“定向委托投资管理交易说明书”组成。您通过恒瑞金服APP界面等点击或以其他方式同意/确认/接受本协议，即表示您确认本公司已充分提示您对本协议的各条款作全面、准确的理解；您确认已完全了解本协议全部内容，您与本公司已就本协议全部内容达成协议并同意接受本协议的全部约定内容、与本协议有关的各项规则以及恒瑞金服APP上所包含的其他与本协议或本协议项下各项规则的条款和条件有关的各项规定。
                    </p>
                    <p>
                       本定向委托投资管理协议由湖南财富恒瑞投资有限公司（以下简称“受托人”）提供，委托湖南金洋信息技术有限公司旗下平台恒瑞金服APP发布。委托人若对本协议的内容有任何疑问，请登录恒瑞金服APP或拨打客服热线400-876-0616进行咨询。受托人有权根据资产情况、市场情况、监管政策等相应修改本说明书。
                    </p>
                    <p>
                        在接受本协议之前，请您仔细阅读本协议的全部内容,如果您不同意本协议的任何内容，或者无法准确理解该条款的含义，请不要进行后续操作。
                    </p>
                    <h1>第一部分：定向委托投资标的</h1>
                    <table class="u-info">
                        <tr>
                            <td colspan="4">委托人（乙方）：</td>
                        </tr>
                        <tr>
                            <td>姓名</td>
                            <td>{{usernamer}}</td>
                            <td>身份证号码</td>
                            <td>{{usercode}}</td>
                        </tr>
                        <tr>
                            <td>定向委托投资本金</td>
                            <td colspan="3" style="text-align:center">{{tenderdetail.PrepayMoney}}元</td>
                        </tr>
                        <tr>
                            <td colspan="4">受托人（甲方）：</td>
                        </tr>
                        <tr>
                            <td>公司名称</td>
                            <td>湖南财富恒瑞投资有限公司</td>
                            <td>注册号</td>
                            <td>431100000037055</td>
                        </tr>
                        <tr>
                            <td colspan="4">定向委托投资标的说明：</td>
                        </tr>
                        <tr>
                            <td>定向委托投资标的名称</td>
                            <td>{{tenderdetail.TenderName}}</td>
                            <td>发布平台</td>
                            <td>恒瑞金服APP</td>
                        </tr>
                        <tr>
                            <td>期限</td>
                            <td>{{tenderdetail.UserDay}}</td>
                            <td>预期收益</td>
                            <td>{{tenderdetail.TenderFee*100}}%</td>
                        </tr>
                    </table>
                    <h1>第二部分：定向委托投资管理交易说明书</h1>
                    <h1>第一章 重要提示</h1>
                    <p>本定向委托投资管理交易说明书（以下简称“本说明书”）为本定向委托投资项目（以下简称“本项目”）涉及的定向委托投资管理交易（以下简称“定向委托投资”）的说明。</p>
                    <p>本次定向委托投资的委托人应保证其为符合中华人民共和国法律（“中国法律”，不包括香港特别行政区、澳门特别行政区和台湾省）、本说明书以及《定向委托投资管理协议》的要求，是具有完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人或合法成立并有效存续的机构。</p>
                    <p>本次定向委托投资的委托人保证其已阅读并知悉本说明书全文，完全理解此类定向委托投资的性质，了解委托人的权利、义务和其中涉及的相关风险，并愿意自行承担投资风险。委托人应自行判断此类定向委托投资标的是否完全符合委托人资产配置和财务规划的需求。</p>
                    <p>本次定向委托投资的委托人保证其已按照恒瑞金服APP上所设置的实名注册程序等要求注册成为平台的实名注册用户。</p>
                    <p>本次定向委托投资的委托人保证其通过平台上传或提交的所有资料均真实、完整、有效、详细、准确，委托人有义务维持并更新其个人资料，保证其资料不存在虚假、过时或不完整的情形。</p>
                    <p>本次定向委托投资的委托人保证其通过平台进行交易的资金来源合法，并对其拥有完全的处分权。委托人对该等资金的使用不会导致对任何其他方权利的侵犯。</p>
                    <p>本次定向委托投资的委托人保证其在平台上进行的操作均为其本人所为，并愿意承担因其操作行为所产生的一切后果。</p>
                    <h1>第二章 名词和解释</h1>
                    <p>在本说明书中，除非上下文另有解释或文义另作说明，本说明书中的词语或简称以及所述的解释规则具有如下含义：</p>
                    <p class="bold">一、各方当事人的定义</p>
                    <p>委托人：系指定向委托投资法律关系中的一个或多个委托方。</p>
                    <p>受托人：系指定向委托投资法律关系中的受托方。</p>
                    <p>发布平台：系指湖南金洋信息技术有限公司运营管理的恒瑞金服APP。</p>
                    <p class="bold">二、定向委托投资相关的定义</p>
                    <p>定向委托投资/委托投资：系指委托人基于对受托人的信任，自愿将合法所有的资金委托给受托人进行管理，定向投资于定向委托投资标的。受托人以委托人利益最大化为原则对定向委托资金按约定进行定向投资管理，以获取期望投资收益，并按照《定向委托投资管理协议》的约定向委托方支付期望收益。</p>
                    <p>定向委托投资标的：系指委托人与受托人约定的定向委托资金所投向的标的。</p>
                    <p>定向委托投资成立日/受让日：系指就本定向委托投资项目在平台发布期限内，全部委托人向受托人交付的委托投资本金合计达到定向委托投资委托总金额100%（含）且经受托人核实确认之日。</p>
                    <p>定向委托投资期望收益起始日：系指定向委托投资本金收益计算的起始日，该日期等于受托人实际取得定向委托投资标的的日期。委托人知悉并确认，委托人交付定向委托投资金额并不意味着可获得定向委托投资期望收益，委托人定向委托投资本金产生收益的情况需根据定向委托投资标的资产情况、交易情况以及完成定向委托投资所需的合理时间等因素进行确定。</p>
                    <p>定向委托投资本金：系指委托人根据《定向委托投资管理协议》的约定，自愿向受托人交付的定向委托投资金额。</p>
                    <p>定向委托投资标的预期收益：系指定向委托投资期望收益获得期内，期望收益占定向委托投资委托总金额的年化比率。期望收益率仅供参考，实际收益率以定向委托投资标的扣除平台服务费用（如有）后计算的实际收益率为准。 </p>
                    <p>平台服务费：系指在定向委托投资期望收益获得期内，平台为定向委托投资关系的委托人及受托人提供信息咨询、发布以及资产管理等，并有权就此服务向委托人收取一定费用，在项目推广期间，平台暂不收取平台服务费，但平台保留收取平台服务费及调整平台服务费率的权利，届时以平台发布的信息为准。</p>
                    <p>平台服务费率：系指在定向委托投资期望收益获得期内，平台服务费用占定向委托投资委托总金额的年化比率。</p>
                    <p>工作日：系指受托人的正常营业日（不包括中国的法定公休日和节假日）。</p>
                    <p>自然日：系指日历日，包括工作日和非工作日。</p>
                    <p>年：系指365个自然日。</p>
                    <p>元：系指人民币。</p>
                    <p>本说明书未作定义或约定的词语，按相关法律、法规及行业惯例解释。</p>
                    <p class="bold">三、交易文件相关的定义</p>
                    <p>《定向委托投资管理协议》：系由委托人与受托人签订的确认定向委托投资关系的法律文件，用以明确定向委托投资中各方的权利和义务。</p>
                    <h1>第三章 相关方介绍</h1>
                    <p class="bold">一、定向委托投资标的投资情况介绍</p>
                    <p>定向委托投资标的为非银行金融机构发行的金融产品。</p>
                    <p class="bold">二、受托人情况介绍</p>
                    <p>湖南财富恒瑞投资有限公司于2014年02月注册成立于湖南省永州市，实收资本10000万元人民币。其业务范围包括：房地产投资；商业项目投资；工程项目投资；农村项目建设投资；农业项目投资；置业发展投资；工业项目投资；旅游项目投资；环保项目投资；林业项目投资；教育项目投资；投资信息咨询服务。法律、行政法规、政策允许旳项目投资；资本运营及投资管理；商业营运管理与商务咨询，资产经营管理及托管服务，财务管理及相关咨询服务，企业管理及市场营销策划，房地产咨询服务，为中小企业和个人提供担保咨询服务；为企业和个人投资提供中介服务。</p>
                    <h1>第四章 信息披露与信息安全</h1>
                    <p>平台根据本说明书的各方当事人的授权进行相关信息披露。</p>
                    <p class="bold">一、信息披露的形式</p>
                    <p>受托人作为信息披露责任人授权平台向委托人进行信息披露，披露的形式包括但不限于电子邮件、在平台网上或手机应用端发布公告、站内信、书面信函等。</p>
                    <p class="bold">二、信息披露的内容</p>
                    <p>1.事件通知</p>
                    <p>本次交易进行过程中，如发生以下事件，平台将根据授权将事件发生的具体情况通知委托人。</p>
                    <p>（1）定向委托投资确认通知</p>
                    <p>当委托人与受托人经平台通过网络在线点击的方式订立定向委托投资协议后，受托人根据协议约定获得定向委托投资本金，平台将根据授权将最终确认的定向委托投资情况告知委托人，通知内容包括委托人定向委托投资金额、定向委托投资期望收益起始日、定向委托投资期望收益到期日等。</p>
                    <p>（2）定向委托投资取消通知</p>
                    <p>因各种原因导致定向委托投资交易无法进行的，受托人应通过平台通知委托人。</p>
                    <p>（3）受托人定向委托投资本金及期望收益支付通知</p>
                    <p>定向委托投资标的到期后，受托人根据本项目的实际收益情况授权平台向委托人发送本金和期望收益支付通知，该通知包括委托人最终获得的实际收益等。</p>
                    <p>2.临时通知</p>
                    <p>在定向委托投资运作过程中发生可能对委托人权益产生重大影响的事件时，受托人应通过平台通知委托人。</p>
                    <p class="bold">三、信息安全</p>
                    <p>1.委托人知晓，受托人以及平台将竭尽所能保护所有委托人的信息安全。</p>
                    <p>2.委托人知晓，因黑客、电脑病毒或委托人的保管疏忽等非受托人或平台的原因导致委托人的账户遭他人非法使用、信息泄露的，受托人以及平台不承担任何责任。任何主体冒用他人账户信息的，应承担相应的责任。</p>
                    <p>3.委托人知晓，平台将严格采取相应技术措施保护委托人的账户安全。同时，平台将运用相关安全技术确保其掌握的信息不丢失、不被滥用和变造。但请注意，尽管平台将竭尽全力保护委托人账户信息安全，委托人账户信息仍可能被窃取。</p>
                    <p>4.委托人账户信息收集及使用</p>
                    <p>委托人知晓并同意，平台有权收集委托人在本项目期间所提交或产生的任何信息及资料，其旨在保障委托人顺利、有效、安全地进行交易等行为。</p>
                    <p>委托人知晓并同意，除委托人向平台自愿提供的信息及资料外，平台可能通过包括但不限于以下方式收集并核对委托人在本项目交易过程中所提交或产生的信息：</p>
                    <p>（1）通过公开及私人资料来源合法收集委托人的额外资料；</p>
                    <p>（2）根据委托人在平台网站或本项目交易过程中的行为自动追踪委托人的相关资料；</p>
                    <p>（3）平台按照《定向委托投资管理协议》的约定对委托人提交的资料承担保密义务。</p>
                    <h1>第五章 通知</h1>
                    <p>本说明书的内容及其他任何委托人在本项目交易期间产生的协议、项目相关交易信息或其他关于本项目的通知，将通过包括但不限于书面通知、电子通讯方式以及其他方式进行。前述电子通讯方式包括但不限于平台公告、站内信或由受托人或平台通过委托人在平台注册时预留的通讯地址（包括手机号码等）发送信息的方式进行通知。</p>
                    <p>关于本交易说明书的内容以及本项目的通知如以公告方式作出的，一经受托人或平台公示即视为已经送达。除此之外，对于以其他形式向委托人发送的通知，除非委托人能够提供证据证明该等信息未被接收，否则该等通知信息一经发送即视为已经送达。委托人应自行密切关注其自身的站内信箱、手机短信。因信息传输、委托人自身查收延迟或遗漏等原因导致委托人未在前述通知发出当日收到该等通知的，受托人以及平台不承担责任。</p>
                    <p>受托人或者平台可能利用上述通知方式向委托人传递包括但不限于如下信息或通知：</p>
                    <p>1.对本说明书作出的修改或任何变更性的内容；</p>
                    <p>2.本项目的交易信息；</p>
                    <p>3.与委托人进行本项目交易及过程中涉及的合同履行相关的通知；</p>
                    <p>4.其他相关内容。</p>
                    <h1>第六章 风险提示</h1>
                    <p>委托人在投资本项目时应充分了解并认可，任何通过平台或受托人进行的交易并不能完全避免以下风险的产生，平台或受托人不能也没有义务为如下风险负责：</p>
                    <p class="bold">一、政策风险</p>
                    <p>因国家法律、法规、行政规章或政策发生重大调整、变化或其他不可预知的意外事件，可能导致本定向委托投资法律关系有效性发生变化，从而可能导致委托人无法实现期望收益乃至本金遭受损失。</p>
                    <p class="bold">二、行业风险</p>
                    <p>定向委托投资标的所处的行业可能会受经济运行周期性变化、所处行业的成熟阶段、上下游供求关系、内部竞争程度及替代品威胁等因素的负面影响，从而可能导致委托人无法实现期望收益乃至本金遭受损失。</p>
                    <p class="bold">三、市场风险</p>
                    <p>资金市场供求关系的变化、货币政策、财政政策、行业政策等因素的变化，以及整体经济形势的变化，可能会对利率、汇率、资金成本和商品价格等因素产生负面影响，从而可能导致委托人无法实现期望收益乃至本金遭受损失。</p>
                    <p class="bold">四、信用风险</p>
                    <p>无论何种原因，当最终使用定向委托投资资产并承担偿还责任的相关方不能按时偿付本金和期望收益时，将导致委托人无法实现期望收益乃至本金遭受损失。</p>
                    <p class="bold">五、管理风险</p>
                    <p>在定向委托投资运作过程中，受托人的管理能力可能会影响定向委托投资本金的期望收益水平。此外，受托人对定向委托投资盈利机会的判断是否准确、投资决策所需获取的信息是否完整、投资操作是否出现失误等，都可能导致委托人无法实现期望收益乃至本金遭受损失。</p>
                    <p class="bold">六、定向委托投资标的风险</p>
                    <p>在实际操作中，委托人可能因为定向委托投资标的投资不成功或者提前结束而面临无法实现期望收益的风险以及与再投资有关的风险。受托人不保证本项目一定盈利，也不保证本项目的最低收益。受托人依据相关文件管理产品所产生的风险，由投资财产承担。委托人需谨慎选择定向委托投资标的进行委托投资。</p>
                    <p class="bold">七、提前到期或延期实现期望收益的风险</p>
                    <p>如因定向委托投资标的发生全部或部分提前到期情况，导致委托人与受托人之间的定向委托投资关系全部或部分提前到期，相应地委托人定向委托投资期望收益将按照实际持有天数计算，委托人面临提前收回投资本金、定向委托投资期望收益少于期望的风险；定向委托投资到期时，若发生前述信用风险，受托人将根据委托人的授权或约定，使用受托人认为适当的方式进行追索，在此过程中，委托人有可能延期实现期望收益乃至本金遭受损失。</p>
                    <p class="bold">八、账户风险</p>
                    <p>交易相关主体的支付能力、道德风险以及账户风险可能导致委托人无法实现期望收益乃至本金遭受损失。</p>
                    <p class="bold">九、操作风险</p>
                    <p>委托人可能会面临如下操作风险：</p>
                    <p>1.不可预测或无法控制的系统故障、设备故障、通讯故障、停电等突发事故将有可能给委托人造成一定损失；</p>
                    <p>2.互联网是全球公共网络，并不受任何一个机构所控制。数据在互联网上传输的途径不是完全确定的，可能会受到非法干扰或侵入。由于存在互联网和移动通讯网络的黑客恶意攻击可能性，委托人可能会遭受损失；</p>
                    <p>3.委托人的账号及密码信息可能被盗或被泄露，客户身份可能被仿冒，委托人可能遭受因此导致的损失；</p>
                    <p>4.在互联网上传输的数据有可能被某些未经许可的个人、团体或机构通过某种渠道获得或篡改。委托人的网络终端设备及软件系统可能会受到非法攻击或病毒感染，导致定向委托投资相关数据无法传输或传输失败，委托人可能遭受因此导致的损失；</p>
                    <p>5.互联网上的数据传输可能因通信繁忙出现延迟，或因其他原因出现中断、停顿或数据不完全、数据错误等情况，从而使交易出现延迟、中断或停顿，可能会造成委托人损失；</p>
                    <p>6.委托人使用的计算机可能因存在性能缺陷、质量问题、计算机病毒、硬件故障及其他原因，而对委托人造成交易时间或交易数据方面的影响，给委托人造成损失；</p>
                    <p>7.委托人操作不当等原因可能会造成委托人损失；</p>
                    <p>8.委托人网上交易、热键操作完毕，未及时退出时，他人进行恶意操作将可能造成委托人损失；</p>
                    <p>9.由于委托人未能及时主动了解定向委托投资资产的信息，或由于通信故障、系统故障以及其他不可抗力等因素的影响，可能导致委托人无法及时做出合理决策，造成委托人损失；</p>
                    <p>10.委托人交由他人代理交易，或长期不关注账户变化，可能会由于他人恶意操作而造成委托人损失。</p>
                    <p class="bold">十、其他风险</p>
                    <p>1.自然灾害、战争、法律法规或政策等无法避免或无法控制的因素的出现，可能会影响市场的正常运行，从而导致定向委托投资标的损失，甚至影响该定向委托投资标的的受理、运行、偿付等的正常进行；</p>
                    <p>2.金融市场危机、行业竞争、代理商违约等超出受托人自身直接控制能力之外的风险，也可能导致委托人利益受损；</p>
                    <p>3.受托人因停业、解散、撤销、破产，或者被监管机构撤销相关业务许可等原因不能履行职责时，可能导致委托人利益受损；</p>
                    <p>4.因其他意外因素和不可抗力而导致的风险。因委托人的过错导致的任何损失，该过错包括但不限于：决策失误、操作不当、遗忘或泄露账户密码、密码被他人破解、委托人使用的计算机系统被第三方侵入、委托人委托他人代理交易时他人恶意或不当操作而造成的损失。</p>
                    <p>以上并不能揭示委托人通过平台进行定向委托投资的全部风险及市场的全部情形。委托人在做出交易决策前，应通过平台公布的信息及其他相关公告了解拟定向委托投资标的的风险收益特征，并根据自身的交易目标、风险承受能力和资产状况等谨慎决策，并自行承担全部风险。</p>
                    <h1>第七章 注意事项</h1>
                    <p class="bold">一、信息发布及更新维护</p>
                    <p>委托人对其通过平台提交的信息具有维护和更新的义务。对于委托人未尽到上述注意义务遭受损失的，受托人或平台不承担责任。</p>
                    <p class="bold">二、禁止对平台数据进行商业性利用 </p>
                    <p>在平台注册过程中以及本项目交易过程中，委托人不应对平台上或在本项目交易过程中获得的任何数据作商业性利用，包括但不限于在未经平台事先书面同意的情况下，以复制、传播等任何方式使用上述资料。</p>
                    <p class="bold">三、遵守法律法规以及相关规定</p>
                    <p>委托人在进行本项目交易过程中及接受相关服务时需要遵守中国法律、法规、规章、其他规范性文件及平台的规则，不得做出违法违规及违反平台规则的行为，具体包括但不限于如下内容：</p>
                    <p>1.发表、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容；</p>
                    <p>2.以制造虚假身份、提交虚假信息等方式来误导、欺骗他人；</p>
                    <p>3.实行危害计算机网络安全的行为（包括但不限于在其所发布的信息中含有蓄意毁坏、恶意干扰、秘密截取或侵占任何系统、数据或个人资料的任何恶意代码、电脑病毒、伪装的木马程序、破坏程序、电脑蠕虫、定时程序炸弹或其他具有类似功能的电脑程序）；</p>
                    <p>4.其他违反法律法规或平台规则的行为。</p>
                    <p>委托人在本项目交易过程中出现上述任意行为或受托人或平台基于合理判断认为委托人存在上述行为的，平台或受托人有权采取限制措施以维护平台、受托人及其他第三方的合法权益。委托人因此遭受的任何损失由其自行承担。</p>

                </div>
            </div>

  </div>

</div>

</template>

<script>
import heads from '../../components/head'
export default {
  data () {
    return {
      title: '定向委托投资管理协议',
      usernamer:"",
      usercode:"",
       fromzero:true,
      tenderdetail:{
        TenderName:"",
        UserDay:"",
        TenderFee:"",



      },
    }
  },

  mounted : function() {

  },
  methods:{

  },
  created:function(){
    let _this = this
    let query = this.$route.query

    console.log(_this.fromzero)
    if(query.fromzero){
        _this.fromzero=!(query.fromzero)

    }

    if(query.tenderfee){
        _this.tenderdetail.TenderName = query.tendername
        _this.tenderdetail.UserDay = query.userday
        _this.tenderdetail.TenderFee = query.tenderfee
        return
    }

    if(typeof this.$store.state.user=="undefined"){
        return
      }

    this.$http(this.$api.getquerymytenderdetail({"OrderCode":query.ordercode}))
      .then((data) => {
        _this.tenderdetail=data.data.ResultData.TenderDetail
      });

    this.$http(this.$api.getuserinfoTotal({}))
      .then((data) => {
        _this.usernamer = data.data.ResultData.RealName
        _this.usercode = data.data.ResultData.IDCardNo
      });

  },
  components:{
heads
  }
}
</script>
<style lang="scss" scoped>
.contract {width:100%; margin:auto;padding:rem(15); box-sizing:border-box;font-size:0.4rem; background:#fff;}
.contract h1{text-align:center; margin-top:rem(10); font-size:0.45rem;}
.contract h2 { margin: 8px 0px; }
.contract p{margin-top:rem(10);}
.contract p.top30{margin-top:rem(30);}
.contract table{border-collapse: collapse; width:100%; margin-top:rem(10)}
.contract table td{border:1px solid #ddd; padding:rem(8); font-size:0.3rem}
.contract .bold{font-weight:bold;}
</style>